

let listData = [
  {
    "name": "学校",
    "data": [
      {
        "name": "学校",
        "data": [
          {
            "name": "学校",
            "val": 0.9999999403953552,
            "data": [
              {
                "site_id": 5077,
                "id": "e93761f6906c800f223bf204",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "温州外国语学校",
                "type": "教育培训/中学",
                "longitude": 120.67294311523438,
                "latitude": 28.009475708007812
              },
              {
                "site_id": 9676,
                "id": "e96b44206298c02482288ac2",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "瓯海文武学校",
                "type": "教育培训/中学",
                "longitude": 120.56774139404297,
                "latitude": 28.00612449645996
              },
              {
                "site_id": 25241,
                "id": "e9878e97809ce51e3a13fd71",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "飞腾艺术培训学校",
                "type": "教育培训",
                "longitude": 120.65231323242188,
                "latitude": 27.780376434326172
              },
              {
                "site_id": 25095,
                "id": "ea847e775fc19176471a3213",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "状元民工子弟学校",
                "type": "教育培训",
                "longitude": 120.75593566894531,
                "latitude": 27.969024658203125
              },
              {
                "site_id": 5439,
                "id": "e96b4420ecdf5e2782288a06",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "锦园社区市民学校",
                "type": "教育培训",
                "longitude": 120.6865005493164,
                "latitude": 28.006492614746094
              },
              {
                "site_id": 28149,
                "id": "ea4a3dc94975b82d4e554715",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "温州越秀学校",
                "type": "教育培训/中学",
                "longitude": 120.81077575683594,
                "latitude": 27.934097290039062
              },
              {
                "site_id": 2528,
                "id": "02ac65c44e9eea7a276e9875",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "林墨培训学校",
                "type": "教育培训",
                "longitude": 120.56018829345703,
                "latitude": 27.665699005126953
              },
              {
                "site_id": 5421,
                "id": "eb3675035d02e91801ec01ab",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "泰顺县行政学校",
                "type": "教育培训/高等院校",
                "longitude": 119.7101821899414,
                "latitude": 27.55588722229004
              },
              {
                "site_id": 6352,
                "id": "f244dc9a36e277fd16c905ae",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "瑞安市马屿社区学校",
                "type": "教育培训",
                "longitude": 120.4494400024414,
                "latitude": 27.780773162841797
              },
              {
                "site_id": 4770,
                "id": "ea4a3dc94959b82d4e554739",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "永嘉县青年培训学校",
                "type": "教育培训",
                "longitude": 120.68338012695312,
                "latitude": 28.15976905822754
              },
              {
                "site_id": 6195,
                "id": "ea4a3dc94959b82d4e554739",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "永嘉县青年培训学校",
                "type": "教育培训",
                "longitude": 120.68338012695312,
                "latitude": 28.15976905822754
              },
              {
                "site_id": 28331,
                "id": "f44609183464e769b01e36ac",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "镇希望学校",
                "type": "教育培训/小学",
                "longitude": 120.89002227783203,
                "latitude": 28.056446075439453
              },
              {
                "site_id": 18296,
                "id": "edd64ce1b138eeec3fe231fd",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "瑞安市万松实验学校",
                "type": "教育培训",
                "longitude": 120.6462631225586,
                "latitude": 27.786102294921875
              },
              {
                "site_id": 12595,
                "id": "3b5beafd6af158eb94031919",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "雁荡山旅游学校",
                "type": "教育培训",
                "longitude": 121.15005493164062,
                "latitude": 28.366249084472656
              },
              {
                "site_id": 20337,
                "id": "0dc3d82d8ef17f6f75e5b678",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "宁益乡学校",
                "type": "教育培训/小学",
                "longitude": 120.281005859375,
                "latitude": 27.83042335510254
              },
              {
                "site_id": 9321,
                "id": "eda7491b9de5483bad31e52c",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "温州市总工会干部学校",
                "type": "教育培训",
                "longitude": 120.65986633300781,
                "latitude": 28.013120651245117
              },
              {
                "site_id": 17459,
                "id": "f2e3d1f94b56e9d30f0e6b8b",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "福鼎市金桥学校",
                "type": "教育培训/中学",
                "longitude": 120.20411682128906,
                "latitude": 27.33107566833496
              },
              {
                "site_id": 17459,
                "id": "f60a15ed84fe77ecba17e7b0",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "福鼎市职工业余学校",
                "type": "教育培训",
                "longitude": 120.21033477783203,
                "latitude": 27.328346252441406
              },
              {
                "site_id": 8641,
                "id": "f300cc15e7877cf9bfa822f8",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "浙南职业学校",
                "type": "教育培训/中学",
                "longitude": 120.60963439941406,
                "latitude": 27.961315155029297
              },
              {
                "site_id": 20906,
                "id": "eb367503e5e2516600ec01c4",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "霓南义务教育学校",
                "type": "教育培训/小学",
                "longitude": 121.0231704711914,
                "latitude": 27.848573684692383
              },
              {
                "site_id": 16484,
                "id": "f60a15edc46eb7efbb17e702",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "乐清英华学校",
                "type": "教育培训/中学",
                "longitude": 120.8907241821289,
                "latitude": 28.0297908782959
              },
              {
                "site_id": 21638,
                "id": "0ce65c2da152b35a2d473353",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "飞林文武学校",
                "type": "教育培训",
                "longitude": 120.29820251464844,
                "latitude": 27.462244033813477
              },
              {
                "site_id": 1811,
                "id": "2fd2beab5f58dc517adbd236",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 121.03012084960938,
                "latitude": 28.219581604003906
              },
              {
                "site_id": 2447,
                "id": "feb76b3bd30ad6efcf06a4f1",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "天天艺术培训学校",
                "type": "教育培训",
                "longitude": 120.39923095703125,
                "latitude": 27.511789321899414
              },
              {
                "site_id": 28134,
                "id": "299d701c621aaec3dbd8917b",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "蒸蒸电脑学校",
                "type": "教育培训",
                "longitude": 120.60445404052734,
                "latitude": 28.02056884765625
              },
              {
                "site_id": 6351,
                "id": "ffd6d403b59abf8c16b54bb4",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "裕靠体育学校",
                "type": "教育培训/其他",
                "longitude": 120.53307342529297,
                "latitude": 27.56888198852539
              },
              {
                "site_id": 1636,
                "id": "2ecbb223aeed4af2fb2d6113",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "永嘉县培智学校",
                "type": "教育培训",
                "longitude": 120.6803207397461,
                "latitude": 28.153865814208984
              },
              {
                "site_id": 20437,
                "id": "50c04c7cbfb4bd6688f15dea",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "综艺培训学校",
                "type": "教育培训",
                "longitude": 120.65727996826172,
                "latitude": 28.01656150817871
              },
              {
                "site_id": 28251,
                "id": "490d0cfdcb10faffddee8b5b",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "丽岙镇学校",
                "type": "教育培训/中学",
                "longitude": 120.63248443603516,
                "latitude": 27.89122200012207
              },
              {
                "site_id": 14916,
                "id": "435d7aeab1e7e2365abbbc52",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "郊外乡中心学校",
                "type": "教育培训",
                "longitude": 120.59750366210938,
                "latitude": 27.466915130615234
              },
              {
                "site_id": 22930,
                "id": "0ffd0cf34eee2211e91e9730",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "大山街育英学校",
                "type": "教育培训",
                "longitude": 120.08321380615234,
                "latitude": 27.795629501342773
              },
              {
                "site_id": 18085,
                "id": "fa08d0d4eeed861c3fe2310c",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "阳光绿洲培训学校",
                "type": "教育培训",
                "longitude": 120.65784454345703,
                "latitude": 28.010976791381836
              },
              {
                "site_id": 5710,
                "id": "08fc93dfe74ed2929b68b411",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "群英文武学校",
                "type": "教育培训/小学",
                "longitude": 120.61344909667969,
                "latitude": 28.054834365844727
              },
              {
                "site_id": 24080,
                "id": "f7fff224309bb931cae33cb0",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "杨府山文化补习学校",
                "type": "教育培训",
                "longitude": 120.74186706542969,
                "latitude": 27.974515914916992
              },
              {
                "site_id": 9730,
                "id": "1a6285c2c164a62d0e3dda31",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育才电脑学校",
                "type": "教育培训",
                "longitude": 120.58975982666016,
                "latitude": 28.081308364868164
              },
              {
                "site_id": 15870,
                "id": "f633606a3047414f0b69d909",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "青田县行政学校",
                "type": "教育培训/高等院校",
                "longitude": 120.2968978881836,
                "latitude": 28.123899459838867
              },
              {
                "site_id": 8793,
                "id": "2bfa068bdbe9da01d4b74ee5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "震旦培训学校",
                "type": "教育培训",
                "longitude": 120.62889862060547,
                "latitude": 27.796260833740234
              },
              {
                "site_id": 113,
                "id": "f4a04e6ef7f7637688f15da4",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "奇奇英语培训学校",
                "type": "教育培训",
                "longitude": 120.83393859863281,
                "latitude": 27.92102813720703
              },
              {
                "site_id": 11839,
                "id": "631c41577f75cf6231f71d69",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "英才学校",
                "type": "教育培训/中学",
                "longitude": 120.62985229492188,
                "latitude": 27.907495498657227
              },
              {
                "site_id": 23039,
                "id": "3a0a78bd7a62cc846318090a",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "创达电脑学校",
                "type": "教育培训",
                "longitude": 120.55052185058594,
                "latitude": 27.581506729125977
              },
              {
                "site_id": 5786,
                "id": "f0a391fd2adcfea06240a911",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "温州瓯越培训学校",
                "type": "教育培训",
                "longitude": 120.67491912841797,
                "latitude": 27.99611473083496
              },
              {
                "site_id": 15950,
                "id": "14076dee9898a68902294f0f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "杨府山高复学校",
                "type": "教育培训",
                "longitude": 120.68412017822266,
                "latitude": 27.94593620300293
              },
              {
                "site_id": 10395,
                "id": "f633606a3047414f0b69d909",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "青田县行政学校",
                "type": "教育培训/高等院校",
                "longitude": 120.2968978881836,
                "latitude": 28.123899459838867
              },
              {
                "site_id": 8869,
                "id": "53cebd50ab02dd1c2a02e1f1",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "乐舟培训学校",
                "type": "教育培训",
                "longitude": 120.68061065673828,
                "latitude": 27.993757247924805
              },
              {
                "site_id": 13355,
                "id": "17cbb44e2f45301cee74f816",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州中专学校",
                "type": "教育培训",
                "longitude": 120.66812133789062,
                "latitude": 27.976076126098633
              },
              {
                "site_id": 24232,
                "id": "3a0fbba8de6e6d3c9ee321f5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "瑞安市社会主义学校",
                "type": "教育培训",
                "longitude": 120.65277862548828,
                "latitude": 27.769163131713867
              },
              {
                "site_id": 23399,
                "id": "55fa2c0b1b5fd32e1ce99904",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "群英文武学校",
                "type": "教育培训/小学",
                "longitude": 120.65174102783203,
                "latitude": 28.050403594970703
              },
              {
                "site_id": 28434,
                "id": "5ce2637d2f3adf51af31e5b0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "福鼎电脑学校",
                "type": "教育培训",
                "longitude": 120.22085571289062,
                "latitude": 27.329936981201172
              },
              {
                "site_id": 10694,
                "id": "803708f18d107804018972fa",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "洞头县行政学校",
                "type": "教育培训",
                "longitude": 121.1480941772461,
                "latitude": 27.839115142822266
              },
              {
                "site_id": 18320,
                "id": "5211d219936c325b7dc8766d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "邹鲁辅导学校",
                "type": "教育培训",
                "longitude": 120.64908599853516,
                "latitude": 27.778270721435547
              },
              {
                "site_id": 19725,
                "id": "7725193086382c5dcae33c12",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "水亭中心学校",
                "type": "教育培训",
                "longitude": 120.52151489257812,
                "latitude": 27.686866760253906
              },
              {
                "site_id": 7759,
                "id": "53cebd50d34865622a02e102",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "春晖学校",
                "type": "教育培训/中学",
                "longitude": 120.87651062011719,
                "latitude": 28.04810905456543
              },
              {
                "site_id": 23518,
                "id": "b14386027142bb9b3310af36",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "艺缘艺术学校",
                "type": "教育培训",
                "longitude": 120.67716217041016,
                "latitude": 27.784027099609375
              },
              {
                "site_id": 6971,
                "id": "8b60775745654b135cbe86f9",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "埔坪学校",
                "type": "教育培训/小学",
                "longitude": 120.36520385742188,
                "latitude": 27.365192413330078
              },
              {
                "site_id": 14531,
                "id": "a74481d642d56a3bf503b8c0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "潜龙学校",
                "type": "教育培训/小学",
                "longitude": 120.56941223144531,
                "latitude": 27.570863723754883
              },
              {
                "site_id": 27240,
                "id": "9f2a070e9f36ebce6f476047",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育才培训学校",
                "type": "教育培训",
                "longitude": 120.69221496582031,
                "latitude": 28.008363723754883
              },
              {
                "site_id": 3335,
                "id": "9f2a070e9f36ebce6f476047",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育才培训学校",
                "type": "教育培训",
                "longitude": 120.69221496582031,
                "latitude": 28.008363723754883
              },
              {
                "site_id": 21742,
                "id": "6deee308d630f56929fc4865",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "林溪乡学校",
                "type": "教育培训/中学",
                "longitude": 120.43092346191406,
                "latitude": 27.92296028137207
              },
              {
                "site_id": 17476,
                "id": "654ddaf625cc05fc246e98d9",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "龙湾区外国语学校",
                "type": "教育培训",
                "longitude": 120.75704956054688,
                "latitude": 27.932889938354492
              },
              {
                "site_id": 10185,
                "id": "33fbfa83c78369c20bf5eb7d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "科兴计算机学校",
                "type": "教育培训",
                "longitude": 120.54747009277344,
                "latitude": 27.65964698791504
              },
              {
                "site_id": 12179,
                "id": "bccd0e61882ad8fcb54f5455",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "振华民工子弟学校",
                "type": "教育培训",
                "longitude": 120.78616333007812,
                "latitude": 27.85947036743164
              },
              {
                "site_id": 4824,
                "id": "fe69503bf95172c47ab55cb0",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "越英语培训学校",
                "type": "教育培训",
                "longitude": 120.56089782714844,
                "latitude": 27.671255111694336
              },
              {
                "site_id": 23930,
                "id": "1aaeeab3c03e7485ece4a5b9",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "振清外国语学校",
                "type": "教育培训",
                "longitude": 120.52786254882812,
                "latitude": 27.573579788208008
              },
              {
                "site_id": 10395,
                "id": "59948b39792081d9128824f3",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "青田县江南学校",
                "type": "教育培训",
                "longitude": 120.28135681152344,
                "latitude": 28.134443283081055
              },
              {
                "site_id": 25524,
                "id": "14076dee9892a68902294f01",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "凤凰学校",
                "type": "教育培训/小学",
                "longitude": 120.84818267822266,
                "latitude": 28.082162857055664
              },
              {
                "site_id": 28108,
                "id": "8ab0dfc437d77815d8eced7d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "平阳文武学校",
                "type": "教育培训",
                "longitude": 120.57469177246094,
                "latitude": 27.653329849243164
              },
              {
                "site_id": 7867,
                "id": "1bf85b253698bbd9a1a934fd",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "东都学校",
                "type": "教育培训/小学",
                "longitude": 120.65542602539062,
                "latitude": 27.748828887939453
              },
              {
                "site_id": 2124,
                "id": "86c36027f16b72d172455b02",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "俊雅音乐学校",
                "type": "教育培训",
                "longitude": 120.82597351074219,
                "latitude": 27.924484252929688
              },
              {
                "site_id": 6592,
                "id": "d29ba7bb993f94c842d63e2e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "林墨培训学校",
                "type": "教育培训",
                "longitude": 120.55616760253906,
                "latitude": 27.678592681884766
              },
              {
                "site_id": 16096,
                "id": "bc547bdac9a71d5541024506",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "天宇职业学校",
                "type": "教育培训",
                "longitude": 120.74246978759766,
                "latitude": 27.97766876220703
              },
              {
                "site_id": 24571,
                "id": "4d4aaadad0997538cd04efb4",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州侨商学校",
                "type": "教育培训",
                "longitude": 119.75237274169922,
                "latitude": 27.585044860839844
              },
              {
                "site_id": 8773,
                "id": "3c5e3e2c384e6a71b6147f4c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "周山中心学校",
                "type": "教育培训",
                "longitude": 120.16650390625,
                "latitude": 27.72138214111328
              },
              {
                "site_id": 3710,
                "id": "52f3bc0c9cd75d14d5851f05",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "番垟新村学校",
                "type": "教育培训",
                "longitude": 119.92488098144531,
                "latitude": 27.618379592895508
              },
              {
                "site_id": 1764,
                "id": "55fa2c0b1b5fd32e1ce99904",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "群英文武学校",
                "type": "教育培训/小学",
                "longitude": 120.65174102783203,
                "latitude": 28.050403594970703
              },
              {
                "site_id": 25304,
                "id": "9382719312fa6ddbaecb660e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "叮叮当才艺学校",
                "type": "教育培训",
                "longitude": 120.57105255126953,
                "latitude": 27.96390151977539
              },
              {
                "site_id": 17621,
                "id": "af0caf666115955f78dbd263",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "雅阳镇社区学校",
                "type": "教育培训",
                "longitude": 120.0398941040039,
                "latitude": 27.390138626098633
              },
              {
                "site_id": 23862,
                "id": "70bf8c4e57c86b2540d63e65",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "红星电脑学校",
                "type": "教育培训",
                "longitude": 120.47701263427734,
                "latitude": 28.16754150390625
              },
              {
                "site_id": 20242,
                "id": "61f634f629d1d57b6b49f37d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.5465087890625,
                "latitude": 27.60576629638672
              },
              {
                "site_id": 27740,
                "id": "6deee308f4dfd31429fc4807",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育人培训学校",
                "type": "教育培训",
                "longitude": 120.55687713623047,
                "latitude": 27.665815353393555
              },
              {
                "site_id": 18818,
                "id": "2ea60375222cf02ead080f02",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州行知学校",
                "type": "教育培训",
                "longitude": 120.69642639160156,
                "latitude": 27.984859466552734
              },
              {
                "site_id": 7786,
                "id": "f961801580cb357603ff2d74",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "管阳镇金钗溪村普法学校",
                "type": "教育培训",
                "longitude": 120.06582641601562,
                "latitude": 27.273635864257812
              },
              {
                "site_id": 8293,
                "id": "6deee308d630f56929fc4865",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "林溪乡学校",
                "type": "教育培训/中学",
                "longitude": 120.43092346191406,
                "latitude": 27.92296028137207
              },
              {
                "site_id": 23296,
                "id": "59ca790d21851a2a715e8037",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "金雅音乐学校",
                "type": "教育培训",
                "longitude": 120.82555389404297,
                "latitude": 27.924192428588867
              },
              {
                "site_id": 19283,
                "id": "9a9341dc5301b7a302294fe1",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "音缘音乐学校",
                "type": "教育培训",
                "longitude": 120.71549987792969,
                "latitude": 27.995616912841797
              },
              {
                "site_id": 7553,
                "id": "3f9337d64c10d6b0f7231048",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "云岩学校",
                "type": "教育培训/中学",
                "longitude": 120.49345397949219,
                "latitude": 27.514501571655273
              },
              {
                "site_id": 7521,
                "id": "7725193086382c5dcae33c12",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "水亭中心学校",
                "type": "教育培训",
                "longitude": 120.52151489257812,
                "latitude": 27.686866760253906
              },
              {
                "site_id": 13992,
                "id": "61f634f61c79c8796b49f3db",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "木栗学校",
                "type": "教育培训/小学",
                "longitude": 120.34174346923828,
                "latitude": 28.44843101501465
              },
              {
                "site_id": 27464,
                "id": "72665f15a198e7894afc8d17",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "创雅电脑学校",
                "type": "教育培训",
                "longitude": 120.54637145996094,
                "latitude": 27.57975196838379
              },
              {
                "site_id": 24650,
                "id": "3c5e3e2c384e6a71b6147f4c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "周山中心学校",
                "type": "教育培训",
                "longitude": 120.16650390625,
                "latitude": 27.72138214111328
              },
              {
                "site_id": 15870,
                "id": "59948b39792081d9128824f3",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "青田县江南学校",
                "type": "教育培训",
                "longitude": 120.28135681152344,
                "latitude": 28.134443283081055
              },
              {
                "site_id": 28384,
                "id": "832c6e680c457301343a718c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "震撼音乐学校",
                "type": "教育培训",
                "longitude": 120.65421295166016,
                "latitude": 27.777435302734375
              },
              {
                "site_id": 23416,
                "id": "b388f9fd6c9c933fb35c6a9d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "林立电脑学校",
                "type": "教育培训",
                "longitude": 120.89530944824219,
                "latitude": 28.049482345581055
              },
              {
                "site_id": 1326,
                "id": "859b7bcca0d99f9095ca0795",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "福鼎市三田学校",
                "type": "教育培训",
                "longitude": 120.31526184082031,
                "latitude": 27.255653381347656
              },
              {
                "site_id": 2387,
                "id": "1eca06235ca93774e81e978f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "吉田造型艺术学校",
                "type": "教育培训",
                "longitude": 120.65492248535156,
                "latitude": 28.00705909729004
              },
              {
                "site_id": 22321,
                "id": "33fbfa83c76069c20bf5eb1c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "新纪元学校",
                "type": "教育培训/中学",
                "longitude": 120.64534759521484,
                "latitude": 27.987873077392578
              },
              {
                "site_id": 5113,
                "id": "6deee308f4dfd31429fc4807",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育人培训学校",
                "type": "教育培训",
                "longitude": 120.55687713623047,
                "latitude": 27.665815353393555
              },
              {
                "site_id": 21128,
                "id": "865a235d62ebd98f95f08c89",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "瑞安天宇学校",
                "type": "教育培训",
                "longitude": 120.65966796875,
                "latitude": 27.774991989135742
              },
              {
                "site_id": 28634,
                "id": "774a5957ff3c8016c8213de1",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "浩铭电脑学校",
                "type": "教育培训",
                "longitude": 120.65603637695312,
                "latitude": 28.043373107910156
              },
              {
                "site_id": 18659,
                "id": "be1ea5efa895bdbc14948e04",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.66410827636719,
                "latitude": 28.02324867248535
              },
              {
                "site_id": 21148,
                "id": "8b96aeff7bc12b52f219375e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "七彩虹培训学校",
                "type": "教育培训",
                "longitude": 120.67361450195312,
                "latitude": 27.979589462280273
              },
              {
                "site_id": 18707,
                "id": "d6eef9d41eaa12f3a2a934bd",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "平阳县育才学校",
                "type": "教育培训",
                "longitude": 120.57525634765625,
                "latitude": 27.65570640563965
              },
              {
                "site_id": 22679,
                "id": "9de9a3e99a47e9da7ec876df",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.62452697753906,
                "latitude": 27.777353286743164
              },
              {
                "site_id": 22258,
                "id": "ae8cc7d9ec13f0b06cc02c39",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "莘莘培训学校",
                "type": "教育培训",
                "longitude": 120.4031982421875,
                "latitude": 27.511272430419922
              },
              {
                "site_id": 10391,
                "id": "d5f93c0edba3645feddfca78",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "曙光学校",
                "type": "教育培训/中学",
                "longitude": 120.07721710205078,
                "latitude": 27.791643142700195
              },
              {
                "site_id": 6163,
                "id": "72e57fd791f078d2f8dc85ff",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "东瓯电脑学校",
                "type": "教育培训",
                "longitude": 120.62833404541016,
                "latitude": 28.043121337890625
              },
              {
                "site_id": 7662,
                "id": "a8ef389f2627797e95ca074e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州市华夏学校",
                "type": "教育培训",
                "longitude": 120.62673950195312,
                "latitude": 27.96579360961914
              },
              {
                "site_id": 14607,
                "id": "fdc9ab5bed3bb6bb08f5ebf6",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "教师进修学校",
                "type": "教育培训",
                "longitude": 120.57093811035156,
                "latitude": 27.659202575683594
              },
              {
                "site_id": 15757,
                "id": "d6c5d991c2c10c9530169bc5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "藤桥镇社区学校",
                "type": "教育培训",
                "longitude": 120.49894714355469,
                "latitude": 28.072429656982422
              },
              {
                "site_id": 11876,
                "id": "d6c5d991c2c10c9530169bc5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "藤桥镇社区学校",
                "type": "教育培训",
                "longitude": 120.49894714355469,
                "latitude": 28.072429656982422
              },
              {
                "site_id": 25289,
                "id": "9fbfeef2628b1d3bede4a538",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育林培训学校",
                "type": "教育培训",
                "longitude": 120.63970947265625,
                "latitude": 28.00747299194336
              },
              {
                "site_id": 1622,
                "id": "dffd631cefa880bd38221ce0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "树人电脑学校",
                "type": "教育培训",
                "longitude": 120.54901885986328,
                "latitude": 27.58068084716797
              },
              {
                "site_id": 16781,
                "id": "befdb292c20acd9c8715413f",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "慧谷学校",
                "type": "教育培训",
                "longitude": 120.96358489990234,
                "latitude": 28.128198623657227
              },
              {
                "site_id": 28434,
                "id": "d7fd2ad3fdf302540accddb0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "茂华学校",
                "type": "教育培训/中学",
                "longitude": 120.2318115234375,
                "latitude": 27.308818817138672
              },
              {
                "site_id": 3681,
                "id": "500a55a866fbbd9142d63eb2",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "民族学校",
                "type": "教育培训",
                "longitude": 120.64151000976562,
                "latitude": 27.69548225402832
              },
              {
                "site_id": 24146,
                "id": "e93761f69097800f223bf27d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "育人培训学校",
                "type": "教育培训",
                "longitude": 120.55003356933594,
                "latitude": 27.600677490234375
              },
              {
                "site_id": 6454,
                "id": "f5ca6b30d7e4c9b703ff2dcc",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "永兴利民学校",
                "type": "教育培训",
                "longitude": 120.81444549560547,
                "latitude": 27.896623611450195
              },
              {
                "site_id": 1515,
                "id": "a3e8341c787d93eb4afd3f38",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "苏步青学校",
                "type": "教育培训/中学",
                "longitude": 120.31964874267578,
                "latitude": 27.681848526000977
              },
              {
                "site_id": 7211,
                "id": "826eda93be6c6533c7f50de5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "叮叮当才艺学校",
                "type": "教育培训",
                "longitude": 120.68252563476562,
                "latitude": 27.9879207611084
              },
              {
                "site_id": 2776,
                "id": "c3269b3648cabb9a4bfc8db8",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "曙光培训学校",
                "type": "教育培训",
                "longitude": 120.65300750732422,
                "latitude": 28.015090942382812
              },
              {
                "site_id": 14145,
                "id": "d7fd2ad3fdf302540accddb0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "茂华学校",
                "type": "教育培训/中学",
                "longitude": 120.2318115234375,
                "latitude": 27.308818817138672
              },
              {
                "site_id": 2324,
                "id": "63445fe1222807dee5e965a6",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "龙湖镇中心学校",
                "type": "教育培训",
                "longitude": 120.28028106689453,
                "latitude": 27.765228271484375
              },
              {
                "site_id": 26364,
                "id": "ee9ca423d5571e346ca3cc16",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "文成县敬业学校",
                "type": "教育培训",
                "longitude": 120.03914642333984,
                "latitude": 27.790822982788086
              },
              {
                "site_id": 8091,
                "id": "d24e48eb2c0a6bb7afee7a4c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "炎亭镇学校",
                "type": "教育培训/中学",
                "longitude": 120.64669799804688,
                "latitude": 27.452342987060547
              },
              {
                "site_id": 17768,
                "id": "14076dee9898a68902294f0f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "杨府山高复学校",
                "type": "教育培训",
                "longitude": 120.68412017822266,
                "latitude": 27.94593620300293
              },
              {
                "site_id": 584,
                "id": "b14386027142bb9b3310af36",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "艺缘艺术学校",
                "type": "教育培训",
                "longitude": 120.67716217041016,
                "latitude": 27.784027099609375
              },
              {
                "site_id": 5081,
                "id": "78bd50f7ede3945831870a39",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "赤水垟学校",
                "type": "教育培训/小学",
                "longitude": 120.85114288330078,
                "latitude": 28.151012420654297
              },
              {
                "site_id": 8562,
                "id": "3947346e337cca98bfa82281",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "南宋学校",
                "type": "教育培训",
                "longitude": 120.38946533203125,
                "latitude": 27.3907470703125
              },
              {
                "site_id": 9451,
                "id": "d7fd2ad34bc2fc560accdde2",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.65567016601562,
                "latitude": 28.04619789123535
              },
              {
                "site_id": 20734,
                "id": "307d818dc9957259213bf249",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "群星学校",
                "type": "教育培训",
                "longitude": 120.73416137695312,
                "latitude": 28.246627807617188
              },
              {
                "site_id": 21665,
                "id": "62d462da8b1ced83b6147fd4",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "海韵音乐学校",
                "type": "教育培训",
                "longitude": 120.65937042236328,
                "latitude": 28.0098934173584
              },
              {
                "site_id": 11001,
                "id": "a5097bfa55960a62f03cba7a",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州市国际象棋学校",
                "type": "教育培训",
                "longitude": 120.65290832519531,
                "latitude": 28.01358413696289
              },
              {
                "site_id": 14327,
                "id": "87741375f1e4d231581093e9",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "春华教育学校",
                "type": "教育培训",
                "longitude": 120.69409942626953,
                "latitude": 27.831104278564453
              },
              {
                "site_id": 6878,
                "id": "e804b71ea71d670c3686f408",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "胡克聪学校",
                "type": "教育培训",
                "longitude": 120.12086486816406,
                "latitude": 27.926740646362305
              },
              {
                "site_id": 22951,
                "id": "dffd631c130124bf38221c48",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "风铃轩培训学校",
                "type": "教育培训",
                "longitude": 120.40072631835938,
                "latitude": 27.510913848876953
              },
              {
                "site_id": 16082,
                "id": "4b98d76f2f1284be14c8f681",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "棠溪学校",
                "type": "教育培训",
                "longitude": 119.67547607421875,
                "latitude": 27.234865188598633
              },
              {
                "site_id": 18501,
                "id": "eba0d9bc5f4f1c1784420e91",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "东方江南学校",
                "type": "教育培训",
                "longitude": 120.57784271240234,
                "latitude": 27.485305786132812
              },
              {
                "site_id": 7373,
                "id": "b7021bf83077fef9f4e73b4c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "浦亭乡学校",
                "type": "教育培训/小学",
                "longitude": 120.35459899902344,
                "latitude": 27.5262451171875
              },
              {
                "site_id": 4986,
                "id": "e2c734e443461f5e15a19050",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "石砰学校",
                "type": "教育培训/小学",
                "longitude": 120.63387298583984,
                "latitude": 27.40381622314453
              },
              {
                "site_id": 24232,
                "id": "d4034eb3e7ec588bc03644fc",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "瑞安市行政学校",
                "type": "教育培训",
                "longitude": 120.65277862548828,
                "latitude": 27.769163131713867
              },
              {
                "site_id": 20449,
                "id": "67b6c722ff656c4e9703195e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "沙城艺术学校",
                "type": "教育培训",
                "longitude": 120.81207275390625,
                "latitude": 27.888349533081055
              },
              {
                "site_id": 12772,
                "id": "605fb65bc8e45189e81e9788",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州美发学校",
                "type": "教育培训",
                "longitude": 120.66282653808594,
                "latitude": 28.008020401000977
              },
              {
                "site_id": 17459,
                "id": "5ce2637d2f3adf51af31e5b0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "福鼎电脑学校",
                "type": "教育培训",
                "longitude": 120.22085571289062,
                "latitude": 27.329936981201172
              },
              {
                "site_id": 10632,
                "id": "62a7691533c745daaeb22a5d",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "顺泰学校",
                "type": "教育培训",
                "longitude": 120.39399719238281,
                "latitude": 27.78605079650879
              },
              {
                "site_id": 11904,
                "id": "807c1c092fa934d6871541f1",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "成才学校",
                "type": "教育培训",
                "longitude": 120.81742858886719,
                "latitude": 27.903430938720703
              },
              {
                "site_id": 8434,
                "id": "e2c734e49bd5a72015a190c3",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "天音音乐学校",
                "type": "教育培训",
                "longitude": 120.6528091430664,
                "latitude": 27.77284049987793
              },
              {
                "site_id": 9733,
                "id": "fa01e937c4853e49774ff16f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "桂峰乡学校",
                "type": "教育培训/小学",
                "longitude": 120.26981353759766,
                "latitude": 27.917591094970703
              },
              {
                "site_id": 8176,
                "id": "c2e50ca2692cda0831169bb7",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓文音乐学校",
                "type": "教育培训",
                "longitude": 120.58357238769531,
                "latitude": 28.066686630249023
              },
              {
                "site_id": 17344,
                "id": "fa7da3e8446b3f6142d63e6b",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "新星学校",
                "type": "教育培训",
                "longitude": 120.75341033935547,
                "latitude": 27.83724021911621
              },
              {
                "site_id": 6025,
                "id": "d3010852fc7c20a4ab059dae",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "芭比娃艺术学校",
                "type": "教育培训",
                "longitude": 120.79777526855469,
                "latitude": 27.873674392700195
              },
              {
                "site_id": 25117,
                "id": "8eb48fa1fc411ca5f32d831c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.6717758178711,
                "latitude": 27.974124908447266
              },
              {
                "site_id": 11776,
                "id": "797c3aecfc2a5f8a2fb17e32",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "云头垟学校",
                "type": "教育培训",
                "longitude": 120.50062561035156,
                "latitude": 27.50981330871582
              },
              {
                "site_id": 16572,
                "id": "d2b3c0e2defc6eb92e47333e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "上金学校",
                "type": "教育培训/小学",
                "longitude": 120.68104553222656,
                "latitude": 27.820331573486328
              },
              {
                "site_id": 4084,
                "id": "90065b64006fddf6c7f02568",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "培林学校",
                "type": "教育培训",
                "longitude": 120.55912017822266,
                "latitude": 27.56557846069336
              },
              {
                "site_id": 6959,
                "id": "aa49bf0d258ad400cc04ef54",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "瑞安市高楼乡学校",
                "type": "教育培训",
                "longitude": 120.28516387939453,
                "latitude": 27.780380249023438
              },
              {
                "site_id": 10554,
                "id": "b48c001583b092b771455bbc",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "环球雅思学校",
                "type": "教育培训",
                "longitude": 120.6554183959961,
                "latitude": 28.0073299407959
              },
              {
                "site_id": 11169,
                "id": "bb1d38e4a646024e0c0a706d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "星苑艺术学校",
                "type": "教育培训",
                "longitude": 120.64607238769531,
                "latitude": 27.781328201293945
              },
              {
                "site_id": 15067,
                "id": "9af4e347d2bb8de3ecdfca84",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 121.15058135986328,
                "latitude": 27.84469223022461
              },
              {
                "site_id": 17573,
                "id": "fd246144e2f4d78978f796e3",
                "val": 1.4258589401543402,
                "relation_val": 1.4258589401543402,
                "name": "小名堂艺术学校",
                "type": "教育培训",
                "longitude": 120.65240478515625,
                "latitude": 28.045852661132812
              },
              {
                "site_id": 10679,
                "id": "9dee307ba7bec89d8936eec6",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "墨城学校",
                "type": "教育培训",
                "longitude": 120.61683654785156,
                "latitude": 27.60588264465332
              },
              {
                "site_id": 15944,
                "id": "cde9e2c7f3828fb7e81e9778",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "东岩乡学校",
                "type": "教育培训",
                "longitude": 120.20197296142578,
                "latitude": 27.813932418823242
              },
              {
                "site_id": 7469,
                "id": "6113ef776d5db1178e77274c",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "腾垟学校",
                "type": "教育培训/小学",
                "longitude": 120.24056243896484,
                "latitude": 27.521072387695312
              },
              {
                "site_id": 17459,
                "id": "637df60a6860760c40afe612",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "少儿美术学校",
                "type": "教育培训",
                "longitude": 120.21199798583984,
                "latitude": 27.33484649658203
              },
              {
                "site_id": 24063,
                "id": "c484913a45388cc2b13c814f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州新星学校",
                "type": "教育培训",
                "longitude": 120.41036987304688,
                "latitude": 27.508506774902344
              },
              {
                "site_id": 227,
                "id": "9de9a3e99a47e9da7ec876df",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "晓雯音乐学校",
                "type": "教育培训",
                "longitude": 120.62452697753906,
                "latitude": 27.777353286743164
              },
              {
                "site_id": 21587,
                "id": "abe1bcc11e2801a549fd3f34",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "文武学校",
                "type": "教育培训",
                "longitude": 120.5713119506836,
                "latitude": 27.658395767211914
              },
              {
                "site_id": 17424,
                "id": "d219bb1dabc81ef6f40e77b3",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "雅西艺术学校",
                "type": "教育培训",
                "longitude": 120.66986846923828,
                "latitude": 27.969768524169922
              },
              {
                "site_id": 12371,
                "id": "d24e48eb7d11d8b5afee7a5a",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "大南乡学校",
                "type": "教育培训/中学",
                "longitude": 120.41109466552734,
                "latitude": 27.717580795288086
              },
              {
                "site_id": 16818,
                "id": "8ab0dfc437d77815d8eced7d",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "平阳文武学校",
                "type": "教育培训",
                "longitude": 120.57469177246094,
                "latitude": 27.653329849243164
              },
              {
                "site_id": 14978,
                "id": "de936bb4a07e01d4e3110313",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "公阳乡中心学校",
                "type": "教育培训",
                "longitude": 120.19534301757812,
                "latitude": 27.719985961914062
              },
              {
                "site_id": 19576,
                "id": "f4a33da9d880c20a3010af6f",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "溪坦学校",
                "type": "教育培训/小学",
                "longitude": 120.43192291259766,
                "latitude": 27.91067123413086
              },
              {
                "site_id": 5950,
                "id": "bc54883de8e7cd6f5bf6bea9",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "爱华民工子弟学校",
                "type": "教育培训",
                "longitude": 120.75463104248047,
                "latitude": 27.966402053833008
              },
              {
                "site_id": 15225,
                "id": "83e200d91aabcb018d7727b3",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州市开元学校",
                "type": "教育培训",
                "longitude": 120.66608428955078,
                "latitude": 28.015108108520508
              },
              {
                "site_id": 22509,
                "id": "cf8a3ef712e914af44e274dc",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "学校路",
                "type": "交通设施/道路",
                "longitude": 120.78038787841797,
                "latitude": 27.964519500732422
              },
              {
                "site_id": 18209,
                "id": "26db36b41451b825eedfca6a",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "曙光学校",
                "type": "教育培训",
                "longitude": 120.62642669677734,
                "latitude": 27.9628849029541
              },
              {
                "site_id": 25950,
                "id": "9412036ad6d8680146e274d2",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州市勤俭学校",
                "type": "教育培训",
                "longitude": 120.64974975585938,
                "latitude": 27.9570369720459
              },
              {
                "site_id": 2387,
                "id": "f8faddb5a59bffa6220262e0",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "华音艺术学校",
                "type": "教育培训",
                "longitude": 120.65493774414062,
                "latitude": 28.007131576538086
              },
              {
                "site_id": 7532,
                "id": "3947346e337cca98bfa82281",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "南宋学校",
                "type": "教育培训",
                "longitude": 120.38946533203125,
                "latitude": 27.3907470703125
              },
              {
                "site_id": 19412,
                "id": "f7d91e87f1e66c2bd4b74eb8",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "鲍田社区学校",
                "type": "医疗",
                "longitude": 120.72254180908203,
                "latitude": 27.823612213134766
              },
              {
                "site_id": 11050,
                "id": "8a2249b51cd41092d7851fc7",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "温州市工艺美术学校",
                "type": "教育培训",
                "longitude": 120.65557098388672,
                "latitude": 28.022165298461914
              },
              {
                "site_id": 6194,
                "id": "dffd631c8fc6a0c138221c0e",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "惠诚培训学校",
                "type": "教育培训",
                "longitude": 120.82264709472656,
                "latitude": 27.92180824279785
              },
              {
                "site_id": 12776,
                "id": "50fb64ff384b285ee9f85334",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "金盾学校",
                "type": "教育培训/中学",
                "longitude": 120.45575714111328,
                "latitude": 28.559890747070312
              },
              {
                "site_id": 21535,
                "id": "f5ca6b30d7e4c9b703ff2dcc",
                "val": 2.547092971640768,
                "relation_val": 2.547092971640768,
                "name": "永兴利民学校",
                "type": "教育培训",
                "longitude": 120.81444549560547,
                "latitude": 27.896623611450195
              },
              {
                "site_id": 5009,
                "id": "7a9932aca6006dfaabf0cd60",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "惠民学校",
                "type": "教育培训/小学",
                "longitude": 120.72638702392578,
                "latitude": 27.985170364379883
              },
              {
                "site_id": 12164,
                "id": "cd9d05dd9dc150b785420e01",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "里仁电脑学校",
                "type": "教育培训",
                "longitude": 120.54914855957031,
                "latitude": 27.580760955810547
              },
              {
                "site_id": 12246,
                "id": "d1469ee7f635856184330451",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "艺声艺术学校",
                "type": "教育培训",
                "longitude": 119.71034240722656,
                "latitude": 27.556438446044922
              },
              {
                "site_id": 26871,
                "id": "dec69804864bd8d131f71ddb",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "上望社区学校",
                "type": "教育培训",
                "longitude": 120.6766357421875,
                "latitude": 27.76443099975586
              },
              {
                "site_id": 4821,
                "id": "e158b4a2754fbe3b5abbbca5",
                "val": 1.8724080782877626,
                "relation_val": 1.8724080782877626,
                "name": "金岙学校",
                "type": "教育培训/中学",
                "longitude": 120.80088806152344,
                "latitude": 27.962543487548828
              }
            ]
          },
          {
            "name": "学堂",
            "val": 0.5783611536026001,
            "data": [
              {
                "site_id": 7387,
                "id": "798ef118257dcb6a8605bf2f",
                "val": 1.6133377128445396,
                "relation_val": 1.6133377128445396,
                "name": "好学堂培训学校",
                "type": "教育培训",
                "longitude": 120.60875701904297,
                "latitude": 28.012117385864258
              },
              {
                "site_id": 6498,
                "id": "7bf7797785c8132359bbbc2c",
                "val": 2.118601273565977,
                "relation_val": 2.118601273565977,
                "name": "三正学堂",
                "type": "教育培训",
                "longitude": 120.62599182128906,
                "latitude": 27.783655166625977
              },
              {
                "site_id": 16539,
                "id": "e96b4420ca9a785a82288ac6",
                "val": 2.881996972873425,
                "relation_val": 2.881996972873425,
                "name": "学堂山",
                "type": "行政区划/村庄",
                "longitude": 120.42436218261719,
                "latitude": 27.885438919067383
              },
              {
                "site_id": 13553,
                "id": "3a0fbba82639d5429ee3212d",
                "val": 2.881996972873425,
                "relation_val": 2.881996972873425,
                "name": "学堂段",
                "type": "行政区划/村庄",
                "longitude": 120.90694427490234,
                "latitude": 27.965564727783203
              }
            ]
          },
          {
            "name": "院校",
            "val": 0.6070029735565186,
            "data": [
              {
                "site_id": 2305,
                "id": "760f01dc81c7b900d7851fdc",
                "val": 1.4919975110830586,
                "relation_val": 1.4919975110830586,
                "name": "董田卫生院(校前路)",
                "type": "医疗/诊所",
                "longitude": 120.68879699707031,
                "latitude": 27.786149978637695
              }
            ]
          },
          {
            "name": "书院",
            "val": 0.5713227987289429,
            "data": [
              {
                "site_id": 1978,
                "id": "99fc98990876fe14a2d230d9",
                "val": 2.566078222201472,
                "relation_val": 2.566078222201472,
                "name": "君子书院",
                "type": "教育培训",
                "longitude": 120.64877319335938,
                "latitude": 27.768709182739258
              },
              {
                "site_id": 10395,
                "id": "d4972515034f2e3f58bbbc25",
                "val": 1.8863644343823267,
                "relation_val": 1.8863644343823267,
                "name": "书院路",
                "type": "交通设施/道路",
                "longitude": 120.28117370605469,
                "latitude": 28.136173248291016
              },
              {
                "site_id": 14241,
                "id": "019763421c370e83343a717b",
                "val": 1.8863644343823267,
                "relation_val": 1.8863644343823267,
                "name": "王瓒书院",
                "type": "旅游景点/风景区",
                "longitude": 120.78285217285156,
                "latitude": 27.912189483642578
              },
              {
                "site_id": 15870,
                "id": "d4972515034f2e3f58bbbc25",
                "val": 1.8863644343823267,
                "relation_val": 1.8863644343823267,
                "name": "书院路",
                "type": "交通设施/道路",
                "longitude": 120.28117370605469,
                "latitude": 28.136173248291016
              },
              {
                "site_id": 15403,
                "id": "40129e95c10381f4f423105b",
                "val": 2.566078222201472,
                "relation_val": 2.566078222201472,
                "name": "桃园书院",
                "type": "购物/商铺",
                "longitude": 120.96302795410156,
                "latitude": 28.127120971679688
              },
              {
                "site_id": 15403,
                "id": "31f9101b94845dc426e0a03d",
                "val": 2.566078222201472,
                "relation_val": 2.566078222201472,
                "name": "框园书院",
                "type": "购物/商铺",
                "longitude": 120.96326446533203,
                "latitude": 28.12750244140625
              },
              {
                "site_id": 15379,
                "id": "038ea9e8cc2781e11a94c658",
                "val": 1.8863644343823267,
                "relation_val": 1.8863644343823267,
                "name": "书院路",
                "type": "交通设施/道路",
                "longitude": 119.70591735839844,
                "latitude": 27.559555053710938
              },
              {
                "site_id": 7309,
                "id": "92b514e27ce300c79d95ded5",
                "val": 2.566078222201472,
                "relation_val": 2.566078222201472,
                "name": "凤凰书院",
                "type": "购物/商铺",
                "longitude": 120.90116119384766,
                "latitude": 28.0313720703125
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "医院",
    "data": [
      {
        "name": "医院",
        "data": [
          {
            "name": "医院",
            "val": 1.0000001192092896,
            "data": [
              {
                "site_id": 15870,
                "id": "aa40108b827d0214c5effb09",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "青田县第二人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.3841552734375,
                "latitude": 28.157573699951172
              },
              {
                "site_id": 24163,
                "id": "b0787b9a2de915deab175a0a",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "泸州地区牙科医院",
                "type": "医疗/专科医院",
                "longitude": 120.61400604248047,
                "latitude": 27.772655487060547
              },
              {
                "site_id": 14330,
                "id": "ae5b024a91a3e7678a36ee47",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "乐清市第五人民医院",
                "type": "医疗/综合医院",
                "longitude": 121.15711975097656,
                "latitude": 28.409767150878906
              },
              {
                "site_id": 20480,
                "id": "cc788fde89d1b99389fc069e",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "温州东瓯皮肤病医院",
                "type": "医疗/综合医院",
                "longitude": 120.64643096923828,
                "latitude": 27.995140075683594
              },
              {
                "site_id": 7808,
                "id": "c5ddcc08468763dfd9131891",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "艺星医疗美容医院",
                "type": "医疗/专科医院",
                "longitude": 120.66060638427734,
                "latitude": 27.985490798950195
              },
              {
                "site_id": 9739,
                "id": "c87c85c76597535d9122e045",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "浙江省乐清市凤凰医院",
                "type": "医疗/综合医院",
                "longitude": 120.98042297363281,
                "latitude": 28.12578582763672
              },
              {
                "site_id": 1168,
                "id": "e889a7446e97afb68605bf5d",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "瓯海区第三人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.67845916748047,
                "latitude": 27.97702980041504
              },
              {
                "site_id": 618,
                "id": "d40fc9e07d9375c34e2fdf43",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "永嘉县第二人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.734130859375,
                "latitude": 28.3450927734375
              },
              {
                "site_id": 10261,
                "id": "c7eca12b077e1a34e015f9a0",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "瑞生微创外科医院",
                "type": "医疗/专科医院",
                "longitude": 120.67627716064453,
                "latitude": 27.796607971191406
              },
              {
                "site_id": 27307,
                "id": "c882ba2f991eb75d79dbd22f",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "乐清市第六人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.85453033447266,
                "latitude": 28.033906936645508
              },
              {
                "site_id": 8156,
                "id": "f4460918341fe769b11e3655",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "华山中西医结合医院",
                "type": "医疗/综合医院",
                "longitude": 120.9590835571289,
                "latitude": 28.105178833007812
              },
              {
                "site_id": 2548,
                "id": "fde11409b74d51c184154166",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "温州东华整形医院",
                "type": "医疗/专科医院",
                "longitude": 120.64888763427734,
                "latitude": 27.996328353881836
              },
              {
                "site_id": 2548,
                "id": "fa7da3e85df5241f42d63ef7",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "温州手足外科医院",
                "type": "医疗/综合医院",
                "longitude": 120.64908599853516,
                "latitude": 27.996353149414062
              },
              {
                "site_id": 24071,
                "id": "d6bbcfbe328a315d213bf263",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "瑞安市第三人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.45942687988281,
                "latitude": 27.779150009155273
              },
              {
                "site_id": 11544,
                "id": "dbf4d6eecf3ec9336ea3cce2",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "温州东方妇产医院",
                "type": "医疗/专科医院",
                "longitude": 120.6754379272461,
                "latitude": 27.982213973999023
              },
              {
                "site_id": 24163,
                "id": "f59bc3591d2c79728605bff8",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "瑞安市人民第二医院",
                "type": "医疗/综合医院",
                "longitude": 120.6148452758789,
                "latitude": 27.77349090576172
              },
              {
                "site_id": 27720,
                "id": "ea4a3dc905b7f4374f5547ad",
                "val": 2.108582877125619,
                "relation_val": 2.108582877125619,
                "name": "温州加美美容医院",
                "type": "医疗/专科医院",
                "longitude": 120.67718505859375,
                "latitude": 28.013954162597656
              },
              {
                "site_id": 9399,
                "id": "7aea43b719c8adfb7c29bd5d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州万福医院",
                "type": "医疗/综合医院",
                "longitude": 120.64743041992188,
                "latitude": 27.969738006591797
              },
              {
                "site_id": 2703,
                "id": "37d60a46e2e31b1d1e1d11f0",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "瑞安隆山医院",
                "type": "医疗/综合医院",
                "longitude": 120.6379623413086,
                "latitude": 27.78217315673828
              },
              {
                "site_id": 14775,
                "id": "1cd8cca97f8e92d1b52655ab",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "星范整形医院",
                "type": "医疗/专科医院",
                "longitude": 120.66585540771484,
                "latitude": 28.022289276123047
              },
              {
                "site_id": 17459,
                "id": "50f7d1469c838fdd72210b54",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "福鼎同济医院",
                "type": "医疗/专科医院",
                "longitude": 120.2135009765625,
                "latitude": 27.309526443481445
              },
              {
                "site_id": 5888,
                "id": "2d99c8d38226827d6b49f3b9",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市肿瘤医院",
                "type": "医疗/专科医院",
                "longitude": 120.61476135253906,
                "latitude": 28.018224716186523
              },
              {
                "site_id": 23665,
                "id": "0b214afe881a9b2cc2f1cf18",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "新华医院(双塔路)",
                "type": "医疗/综合医院",
                "longitude": 120.64007568359375,
                "latitude": 28.044166564941406
              },
              {
                "site_id": 7332,
                "id": "161a0ed2ba50cd535cd4fe59",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市中心医院",
                "type": "医疗/综合医院",
                "longitude": 120.65352630615234,
                "latitude": 28.02382469177246
              },
              {
                "site_id": 3039,
                "id": "1a32ed1545e3d13f2fb96dcf",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市儿童医院",
                "type": "医疗/综合医院",
                "longitude": 120.69081115722656,
                "latitude": 28.00217056274414
              },
              {
                "site_id": 22129,
                "id": "a90bd2e70d84816b774ff1b7",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "永嘉县乌牛医院",
                "type": "医疗/综合医院",
                "longitude": 120.78790283203125,
                "latitude": 28.027681350708008
              },
              {
                "site_id": 9869,
                "id": "0bc5d9068c332d831329357c",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "博爱医院分院",
                "type": "医疗/综合医院",
                "longitude": 120.57003021240234,
                "latitude": 27.565073013305664
              },
              {
                "site_id": 15870,
                "id": "0381850894c8ac6688db73d6",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田康宁医院",
                "type": "医疗/综合医院",
                "longitude": 120.29595184326172,
                "latitude": 28.124116897583008
              },
              {
                "site_id": 5235,
                "id": "6efde5b5692b492f5e17c33d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "县第二医院",
                "type": "医疗/综合医院",
                "longitude": 120.31541442871094,
                "latitude": 27.636829376220703
              },
              {
                "site_id": 22039,
                "id": "34e48508d0a4e2e1d8d89159",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "永嘉金瓯医院",
                "type": "医疗/综合医院",
                "longitude": 120.63728332519531,
                "latitude": 28.04898452758789
              },
              {
                "site_id": 2324,
                "id": "679d7cde259ea1ad29d7aba9",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "高楼中心医院",
                "type": "医疗/综合医院",
                "longitude": 120.28058624267578,
                "latitude": 27.76696014404297
              },
              {
                "site_id": 22083,
                "id": "c37ab9455f52a9fed6b74ecc",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "罗阳镇医院",
                "type": "医疗/综合医院",
                "longitude": 119.71508026123047,
                "latitude": 27.566194534301758
              },
              {
                "site_id": 13076,
                "id": "e93905a841922195f42310c5",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "黎明医院门诊楼",
                "type": "医疗",
                "longitude": 120.70173645019531,
                "latitude": 28.00348472595215
              },
              {
                "site_id": 2390,
                "id": "d52831f96533aaa62ffaa7b8",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州广化医院",
                "type": "医疗/综合医院",
                "longitude": 120.6335220336914,
                "latitude": 28.02153778076172
              },
              {
                "site_id": 24785,
                "id": "beabdbf455d78d9b7169d3a5",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "平阳县萧江医院",
                "type": "医疗/综合医院",
                "longitude": 120.46863555908203,
                "latitude": 27.5704288482666
              },
              {
                "site_id": 7310,
                "id": "2d99c8d38226827d6b49f3b9",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市肿瘤医院",
                "type": "医疗/专科医院",
                "longitude": 120.61476135253906,
                "latitude": 28.018224716186523
              },
              {
                "site_id": 23547,
                "id": "5002435147029634b45f1e9f",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市妇产科医院",
                "type": "医疗/专科医院",
                "longitude": 120.65049743652344,
                "latitude": 28.01542854309082
              },
              {
                "site_id": 1526,
                "id": "08fc93dfe7ead2929a68b4b5",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "苍南县人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.40156555175781,
                "latitude": 27.507328033447266
              },
              {
                "site_id": 10395,
                "id": "0381850894c8ac6688db73d6",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田康宁医院",
                "type": "医疗/综合医院",
                "longitude": 120.29595184326172,
                "latitude": 28.124116897583008
              },
              {
                "site_id": 8728,
                "id": "3a0a78bd6dbfdbf96318095a",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "永嘉第三医院",
                "type": "医疗/综合医院",
                "longitude": 120.478271484375,
                "latitude": 28.167970657348633
              },
              {
                "site_id": 4249,
                "id": "50f7d1466dfa9edd73210b9e",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州广慈医院",
                "type": "医疗/综合医院",
                "longitude": 120.63774871826172,
                "latitude": 28.005754470825195
              },
              {
                "site_id": 16055,
                "id": "c21db9e599a4b0fd01ff2d83",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "鹿城人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.59928894042969,
                "latitude": 28.022830963134766
              },
              {
                "site_id": 23547,
                "id": "eb661c5417363e8e09a8d4a3",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.65050506591797,
                "latitude": 28.01543617248535
              },
              {
                "site_id": 2682,
                "id": "4cf8d24e437e2c9a9cf7790a",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "浙江省眼科医院",
                "type": "医疗/专科医院",
                "longitude": 120.66785430908203,
                "latitude": 28.010517120361328
              },
              {
                "site_id": 20625,
                "id": "c34566f99b062b185cd4fece",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "南城新区医院",
                "type": "医疗/综合医院",
                "longitude": 119.85713195800781,
                "latitude": 28.41804313659668
              },
              {
                "site_id": 8287,
                "id": "33fbfa83c77e69c20bf5eb06",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "湖头医院",
                "type": "医疗/诊所",
                "longitude": 120.87013244628906,
                "latitude": 28.066343307495117
              },
              {
                "site_id": 2776,
                "id": "707af89e44c2c558a0acc425",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清骨科医院",
                "type": "医疗/专科医院",
                "longitude": 120.65335083007812,
                "latitude": 28.015153884887695
              },
              {
                "site_id": 22247,
                "id": "d5f93c0edbf3645fecdfcaa8",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "慈爱康复医院",
                "type": "医疗/综合医院",
                "longitude": 120.44426727294922,
                "latitude": 27.23455047607422
              },
              {
                "site_id": 17001,
                "id": "55a0bff690239465e31103f3",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清市人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.96678924560547,
                "latitude": 28.10765838623047
              },
              {
                "site_id": 22860,
                "id": "04bdf4a3dd920d4c344aaea7",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "腾蛟中心医院",
                "type": "医疗/综合医院",
                "longitude": 120.32463073730469,
                "latitude": 27.6862735748291
              },
              {
                "site_id": 15071,
                "id": "509beee006f60cad88b988ff",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市友好医院",
                "type": "医疗/综合医院",
                "longitude": 120.66303253173828,
                "latitude": 28.010570526123047
              },
              {
                "site_id": 11227,
                "id": "368a280011ea31582a3a9fab",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "薪堂中医医院",
                "type": "医疗",
                "longitude": 120.70347595214844,
                "latitude": 27.834856033325195
              },
              {
                "site_id": 17189,
                "id": "e911e6aba03186dc9d82ea47",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "福鼎龙安医院",
                "type": "医疗",
                "longitude": 120.36662292480469,
                "latitude": 27.19026756286621
              },
              {
                "site_id": 4407,
                "id": "aaed96431ac41f739e82eaeb",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州同济医院",
                "type": "医疗/专科医院",
                "longitude": 120.67980194091797,
                "latitude": 28.008625030517578
              },
              {
                "site_id": 10613,
                "id": "255fb2285d811e3c6e20b9b8",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "贵州省肿瘤医院",
                "type": "医疗/专科医院",
                "longitude": 120.58639526367188,
                "latitude": 28.029821395874023
              },
              {
                "site_id": 2305,
                "id": "fca1e5e911d5d3a331870a4e",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "王华骨伤医院",
                "type": "医疗/专科医院",
                "longitude": 120.69271850585938,
                "latitude": 27.78826141357422
              },
              {
                "site_id": 13317,
                "id": "4d0e878b31507c79e215f9d8",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "湖岭医院",
                "type": "医疗/综合医院",
                "longitude": 120.38519287109375,
                "latitude": 27.90509605407715
              },
              {
                "site_id": 19549,
                "id": "bff8fa7dd2d33ea3c9213da7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "鳌江镇医院",
                "type": "医疗/综合医院",
                "longitude": 120.55533599853516,
                "latitude": 27.593122482299805
              },
              {
                "site_id": 7324,
                "id": "eeef6edc0c55984ff8f0cb7d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "平阳县人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.56208801269531,
                "latitude": 27.670923233032227
              },
              {
                "site_id": 10395,
                "id": "8e675f56de37ae132bb97c94",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田县人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.28314971923828,
                "latitude": 28.13365936279297
              },
              {
                "site_id": 24887,
                "id": "7480c77904b1f838c9213da6",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "瓯海区新桥医院",
                "type": "医疗/综合医院",
                "longitude": 120.6196517944336,
                "latitude": 27.986961364746094
              },
              {
                "site_id": 8194,
                "id": "cde9e2c7f3a18fb7e81e9759",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "瓯北医院",
                "type": "医疗/综合医院",
                "longitude": 120.6339111328125,
                "latitude": 28.051387786865234
              },
              {
                "site_id": 26405,
                "id": "435d7aeafae3ab2c5bbbbca4",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州友好医院",
                "type": "医疗/综合医院",
                "longitude": 120.67591857910156,
                "latitude": 27.999662399291992
              },
              {
                "site_id": 11544,
                "id": "81d6a50996bb02436e20b95d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "东方女子医院",
                "type": "医疗/专科医院",
                "longitude": 120.6754379272461,
                "latitude": 27.982206344604492
              },
              {
                "site_id": 2565,
                "id": "07f3c8b510d544606340a9a4",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "平阳县麻步医院",
                "type": "医疗",
                "longitude": 120.41458129882812,
                "latitude": 27.5919246673584
              },
              {
                "site_id": 10593,
                "id": "37d60a467810a1611f1d1180",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "洞头县人民医院",
                "type": "医疗/综合医院",
                "longitude": 121.15225982666016,
                "latitude": 27.843074798583984
              },
              {
                "site_id": 5930,
                "id": "b292b3aa0f82c82bbe4842fc",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "丽岙医院",
                "type": "医疗/综合医院",
                "longitude": 120.63330841064453,
                "latitude": 27.901382446289062
              },
              {
                "site_id": 17459,
                "id": "e3a7fd135a915d4b28b97c54",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "福鼎华山医院",
                "type": "医疗",
                "longitude": 120.21125793457031,
                "latitude": 27.329757690429688
              },
              {
                "site_id": 10613,
                "id": "70ce326c0f2e7548d8131864",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "漳州市医院(妇产科)",
                "type": "医疗/综合医院",
                "longitude": 120.58639526367188,
                "latitude": 28.029821395874023
              },
              {
                "site_id": 28434,
                "id": "50f7d1469c838fdd72210b54",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "福鼎同济医院",
                "type": "医疗/专科医院",
                "longitude": 120.2135009765625,
                "latitude": 27.309526443481445
              },
              {
                "site_id": 15870,
                "id": "d0fc41951fda6bf9f6b916ad",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田维康骨科医院",
                "type": "医疗/专科医院",
                "longitude": 120.37722778320312,
                "latitude": 28.152746200561523
              },
              {
                "site_id": 17103,
                "id": "1a32ed1545e3d13f2fb96dcf",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市儿童医院",
                "type": "医疗/综合医院",
                "longitude": 120.69081115722656,
                "latitude": 28.00217056274414
              },
              {
                "site_id": 9235,
                "id": "81d6a50996bd02436e20b95b",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清口腔医院",
                "type": "医疗/专科医院",
                "longitude": 120.89391326904297,
                "latitude": 28.044857025146484
              },
              {
                "site_id": 23585,
                "id": "f28bb0449001b9445cd4feb8",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清市红十字医院",
                "type": "医疗/综合医院",
                "longitude": 120.88587188720703,
                "latitude": 28.040538787841797
              },
              {
                "site_id": 17365,
                "id": "e96b44200aff384082288a03",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州建国医院",
                "type": "医疗/综合医院",
                "longitude": 120.66188049316406,
                "latitude": 27.985353469848633
              },
              {
                "site_id": 18070,
                "id": "2e420f5f4b3bdb6638221c8b",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "乐清虹丰医院",
                "type": "医疗",
                "longitude": 121.02703857421875,
                "latitude": 28.21088218688965
              },
              {
                "site_id": 14061,
                "id": "13d2ab1abdd4d4d6fa42b245",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "瓯海区人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.63128662109375,
                "latitude": 28.012584686279297
              },
              {
                "site_id": 24275,
                "id": "3a0a78bd6dbfdbf96318095a",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "永嘉第三医院",
                "type": "医疗/综合医院",
                "longitude": 120.478271484375,
                "latitude": 28.167970657348633
              },
              {
                "site_id": 28127,
                "id": "1bf85b25363dbbd9a1a93460",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "南山法敏骨伤医院",
                "type": "医疗/专科医院",
                "longitude": 119.79304504394531,
                "latitude": 28.335147857666016
              },
              {
                "site_id": 7332,
                "id": "419d2a309338385f9e95de23",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "温州市肿瘤医院",
                "type": "医疗",
                "longitude": 120.65352630615234,
                "latitude": 28.023664474487305
              },
              {
                "site_id": 17569,
                "id": "e889a7443782e6ac8705bfa4",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "光明医院",
                "type": "医疗/综合医院",
                "longitude": 120.70172119140625,
                "latitude": 28.00358772277832
              },
              {
                "site_id": 26039,
                "id": "480b24d0776c13e89cec2b54",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "柘荣县医院",
                "type": "医疗/综合医院",
                "longitude": 119.89680480957031,
                "latitude": 27.241912841796875
              },
              {
                "site_id": 27962,
                "id": "68ee0f49f1b7aa7681a12ea1",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "锦隆电脑医院",
                "type": "医疗",
                "longitude": 120.50183868408203,
                "latitude": 28.067272186279297
              },
              {
                "site_id": 15338,
                "id": "d24e48eb2cd56bb7afee7a11",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "上戍医院",
                "type": "医疗/诊所",
                "longitude": 120.54224395751953,
                "latitude": 28.0863094329834
              },
              {
                "site_id": 20189,
                "id": "b292b3aa0f82c82bbe4842fc",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "丽岙医院",
                "type": "医疗/综合医院",
                "longitude": 120.63330841064453,
                "latitude": 27.901382446289062
              },
              {
                "site_id": 12586,
                "id": "93df0dc331166c28892fb5a7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "曹村医院",
                "type": "医疗/综合医院",
                "longitude": 120.457275390625,
                "latitude": 27.71126937866211
              },
              {
                "site_id": 25629,
                "id": "befdb2920ffe00f8861541a7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "滨海医院",
                "type": "医疗/综合医院",
                "longitude": 120.80976867675781,
                "latitude": 27.871437072753906
              },
              {
                "site_id": 10395,
                "id": "f4c8f78e9c5ebfe8b75f1ecf",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田县惠民医院",
                "type": "医疗/综合医院",
                "longitude": 120.2947006225586,
                "latitude": 28.134641647338867
              },
              {
                "site_id": 25950,
                "id": "2527be1e2db62baa4bfc8da3",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "中山医院",
                "type": "医疗",
                "longitude": 120.65184783935547,
                "latitude": 27.95677375793457
              },
              {
                "site_id": 17459,
                "id": "79cceb3688602b901e580054",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "福鼎市医院",
                "type": "医疗/综合医院",
                "longitude": 120.21210479736328,
                "latitude": 27.32599639892578
              },
              {
                "site_id": 27327,
                "id": "ffd6d4038ce7f69616b54ba7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "金乡医院",
                "type": "医疗/综合医院",
                "longitude": 120.61022186279297,
                "latitude": 27.434036254882812
              },
              {
                "site_id": 762,
                "id": "edd64ce169a556923fe2315f",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "海滨医院",
                "type": "医疗/综合医院",
                "longitude": 120.83926391601562,
                "latitude": 27.921255111694336
              },
              {
                "site_id": 4886,
                "id": "87c3274e7850bb7c2811d110",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "苍南金城医院",
                "type": "医疗",
                "longitude": 120.60227966308594,
                "latitude": 27.440889358520508
              },
              {
                "site_id": 18309,
                "id": "6efde5b5692b492f5e17c33d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "县第二医院",
                "type": "医疗/综合医院",
                "longitude": 120.31541442871094,
                "latitude": 27.636829376220703
              },
              {
                "site_id": 9138,
                "id": "8b79beda5e6ebdbbb2077d4d",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "郭溪医院",
                "type": "医疗",
                "longitude": 120.56372833251953,
                "latitude": 27.994869232177734
              },
              {
                "site_id": 17351,
                "id": "dcc4b0e33859e86fc9e33c6c",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "瑞安同济医院",
                "type": "医疗",
                "longitude": 120.6333999633789,
                "latitude": 27.777132034301758
              },
              {
                "site_id": 15627,
                "id": "b3d83bbe0e2e9e8e2902e142",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "乐清仁济医院",
                "type": "医疗",
                "longitude": 120.96439361572266,
                "latitude": 28.11569595336914
              },
              {
                "site_id": 28692,
                "id": "dc7b5c1416cbbb889cf77992",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "利济医院",
                "type": "医疗",
                "longitude": 120.62976837158203,
                "latitude": 27.78575897216797
              },
              {
                "site_id": 28127,
                "id": "ed649ae16b4aa0f149fd3fab",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "丽水碧湖医院",
                "type": "医疗/综合医院",
                "longitude": 119.78301239013672,
                "latitude": 28.34029769897461
              },
              {
                "site_id": 28068,
                "id": "864cb6d715e6eb76d518b719",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "温州市红旗医院",
                "type": "医疗",
                "longitude": 120.68377685546875,
                "latitude": 27.985286712646484
              },
              {
                "site_id": 9448,
                "id": "6ed3083a976d3bb62b3a9f09",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "山口中心医院",
                "type": "医疗",
                "longitude": 120.31419372558594,
                "latitude": 28.07124900817871
              },
              {
                "site_id": 16226,
                "id": "e911e6aba03186dc9d82ea47",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "福鼎龙安医院",
                "type": "医疗",
                "longitude": 120.36662292480469,
                "latitude": 27.19026756286621
              },
              {
                "site_id": 15870,
                "id": "f4c8f78e9c5ebfe8b75f1ecf",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田县惠民医院",
                "type": "医疗/综合医院",
                "longitude": 120.2947006225586,
                "latitude": 28.134641647338867
              },
              {
                "site_id": 516,
                "id": "ffb479ef9e3a12b576e5b610",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "爱尔五官科医院",
                "type": "医疗/专科医院",
                "longitude": 120.72454071044922,
                "latitude": 27.992204666137695
              },
              {
                "site_id": 2371,
                "id": "c59d23ff7d47e91c8936eec2",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "瑞安华康医院",
                "type": "医疗/专科医院",
                "longitude": 120.6900634765625,
                "latitude": 27.783214569091797
              },
              {
                "site_id": 14244,
                "id": "5b25f446605b56e91029355f",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "曙光医院",
                "type": "医疗/专科医院",
                "longitude": 120.95657348632812,
                "latitude": 28.116939544677734
              },
              {
                "site_id": 20625,
                "id": "b1c556e880dd4c0fb426557b",
                "val": 5.51836520996028,
                "relation_val": 5.51836520996028,
                "name": "医院",
                "type": "医疗",
                "longitude": 119.94491577148438,
                "latitude": 28.350528717041016
              },
              {
                "site_id": 28390,
                "id": "3dc9befd0fc6f00fbfa240a7",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "永嘉江南医院",
                "type": "医疗/综合医院",
                "longitude": 120.68549346923828,
                "latitude": 28.067672729492188
              },
              {
                "site_id": 12323,
                "id": "a5097bfae4bd9960f03cba5d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "糖尿病专科医院",
                "type": "医疗/专科医院",
                "longitude": 120.72216796875,
                "latitude": 27.991416931152344
              },
              {
                "site_id": 16399,
                "id": "e96b4420d9ec655882288a3a",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "景宁县人民医院",
                "type": "医疗/综合医院",
                "longitude": 119.63217163085938,
                "latitude": 27.974245071411133
              },
              {
                "site_id": 18644,
                "id": "060f5e53d85aefd4091cc7a2",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "娄桥医院",
                "type": "医疗/综合医院",
                "longitude": 120.61233520507812,
                "latitude": 27.962705612182617
              },
              {
                "site_id": 7863,
                "id": "1eeed5466375d8f1b5147f11",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "藤桥医院",
                "type": "医疗",
                "longitude": 120.5014877319336,
                "latitude": 28.072603225708008
              },
              {
                "site_id": 14207,
                "id": "130986dc2fdbb364a20464c7",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "温州市惠民医院",
                "type": "医疗",
                "longitude": 120.65149688720703,
                "latitude": 28.01555061340332
              },
              {
                "site_id": 20183,
                "id": "54bdc685f0f3c6dbd5b74e8d",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "潘桥医院",
                "type": "医疗",
                "longitude": 120.56825256347656,
                "latitude": 27.959253311157227
              },
              {
                "site_id": 2217,
                "id": "d67bb524dafadc052fb96d64",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "永嘉金瓯医院",
                "type": "医疗",
                "longitude": 120.61502838134766,
                "latitude": 28.05031394958496
              },
              {
                "site_id": 12961,
                "id": "75d0881acdae0a4e3a04b155",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "碧莲医院",
                "type": "医疗",
                "longitude": 120.55451202392578,
                "latitude": 28.312305450439453
              },
              {
                "site_id": 20625,
                "id": "a243f46b84de7910e8e5826e",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "丽水协和医院",
                "type": "医疗",
                "longitude": 119.85617065429688,
                "latitude": 28.42442512512207
              },
              {
                "site_id": 419,
                "id": "ed4df1efb5b9d61b902ca362",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "马站医院",
                "type": "医疗/综合医院",
                "longitude": 120.4554214477539,
                "latitude": 27.2667293548584
              },
              {
                "site_id": 1764,
                "id": "373cf75761df256d4254d7ad",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "瑞金医院",
                "type": "医疗/综合医院",
                "longitude": 120.65249633789062,
                "latitude": 28.046825408935547
              },
              {
                "site_id": 14494,
                "id": "38e480372dcbfb4a363a71a4",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "东方医院",
                "type": "医疗/综合医院",
                "longitude": 120.54737854003906,
                "latitude": 27.581241607666016
              },
              {
                "site_id": 4480,
                "id": "4140e7ccf6c964254f3a592a",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "乐清牙科医院",
                "type": "医疗/专科医院",
                "longitude": 120.96524047851562,
                "latitude": 28.112960815429688
              },
              {
                "site_id": 26457,
                "id": "f9fd6062fa1afc620f0e6bf4",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "上望医院",
                "type": "医疗",
                "longitude": 120.6740951538086,
                "latitude": 27.7739315032959
              },
              {
                "site_id": 13478,
                "id": "0622f3d3257301c4b320a8c3",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "双潮医院",
                "type": "医疗/综合医院",
                "longitude": 120.44523620605469,
                "latitude": 28.138877868652344
              },
              {
                "site_id": 16148,
                "id": "af2656b2605c27c53913fdb1",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "上塘镇医院",
                "type": "医疗/综合医院",
                "longitude": 120.6937484741211,
                "latitude": 28.15618896484375
              },
              {
                "site_id": 16816,
                "id": "2527be1e2db62baa4bfc8da3",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "中山医院",
                "type": "医疗",
                "longitude": 120.65184783935547,
                "latitude": 27.95677375793457
              },
              {
                "site_id": 28434,
                "id": "d1469ee7cd1ccc7b84330454",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "海桐医院",
                "type": "医疗",
                "longitude": 120.21663665771484,
                "latitude": 27.312992095947266
              },
              {
                "site_id": 3786,
                "id": "70292957926eae2272455b3e",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "庄稼医院",
                "type": "医疗",
                "longitude": 120.9304428100586,
                "latitude": 28.033203125
              },
              {
                "site_id": 11708,
                "id": "e308284802a0debcb34c496b",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "天河医院",
                "type": "医疗/诊所",
                "longitude": 120.78617858886719,
                "latitude": 27.86334991455078
              },
              {
                "site_id": 13773,
                "id": "4777dfe01e192e794054d7f8",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "阁巷医院",
                "type": "医疗/综合医院",
                "longitude": 120.6512451171875,
                "latitude": 27.702816009521484
              },
              {
                "site_id": 25157,
                "id": "e371b43ab1ef955183a00cd8",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "温州华康医院",
                "type": "医疗",
                "longitude": 120.69086456298828,
                "latitude": 28.01023292541504
              },
              {
                "site_id": 770,
                "id": "e2c734e4434d1f5e15a19059",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "利民医院",
                "type": "医疗/综合医院",
                "longitude": 120.62657928466797,
                "latitude": 28.04705238342285
              },
              {
                "site_id": 219,
                "id": "b292b3aaf809394fbf4842a7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "临江医院",
                "type": "医疗/综合医院",
                "longitude": 120.48375701904297,
                "latitude": 28.13569450378418
              },
              {
                "site_id": 18342,
                "id": "dc7b5c1416cbbb889cf77992",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "利济医院",
                "type": "医疗",
                "longitude": 120.62976837158203,
                "latitude": 27.78575897216797
              },
              {
                "site_id": 11681,
                "id": "70292957926eae2272455b3e",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "庄稼医院",
                "type": "医疗",
                "longitude": 120.9304428100586,
                "latitude": 28.033203125
              },
              {
                "site_id": 26124,
                "id": "f97d15ceda68a4099cec2b67",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州梧田医院",
                "type": "医疗/综合医院",
                "longitude": 120.65560913085938,
                "latitude": 27.95902442932129
              },
              {
                "site_id": 9651,
                "id": "bba19c1d7462bd38d2f49e50",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "霞关医院",
                "type": "医疗/综合医院",
                "longitude": 120.4668960571289,
                "latitude": 27.17230224609375
              },
              {
                "site_id": 1998,
                "id": "1ba35ca4cc7cc587ca2915f0",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "泽雅医院",
                "type": "医疗/综合医院",
                "longitude": 120.48504638671875,
                "latitude": 28.033283233642578
              },
              {
                "site_id": 4352,
                "id": "eeef6edc0c55984ff8f0cb7d",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "平阳县人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.56208801269531,
                "latitude": 27.670923233032227
              },
              {
                "site_id": 6490,
                "id": "d1469ee7f8049f1f84330460",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清东南医院",
                "type": "医疗/综合医院",
                "longitude": 120.96173095703125,
                "latitude": 28.1192684173584
              },
              {
                "site_id": 22388,
                "id": "dc9d7e48218e3c632102201e",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "骨科医院",
                "type": "医疗/专科医院",
                "longitude": 121.01790618896484,
                "latitude": 28.187280654907227
              },
              {
                "site_id": 5341,
                "id": "fb92b222dfd7d1bad23ce353",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "仰义医院",
                "type": "医疗",
                "longitude": 120.58342742919922,
                "latitude": 28.064035415649414
              },
              {
                "site_id": 7603,
                "id": "08fc93dfe7bbd2929b68b46a",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "朱雅医院",
                "type": "医疗",
                "longitude": 120.14665222167969,
                "latitude": 27.946802139282227
              },
              {
                "site_id": 24163,
                "id": "e9ca152c4313ee646e3e1b46",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "仙降医院",
                "type": "医疗/综合医院",
                "longitude": 120.61424255371094,
                "latitude": 27.772777557373047
              },
              {
                "site_id": 1858,
                "id": "55a0bff690239465e31103f3",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "乐清市人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.96678924560547,
                "latitude": 28.10765838623047
              },
              {
                "site_id": 13076,
                "id": "e889a7443782e6ac8705bfa4",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "光明医院",
                "type": "医疗/综合医院",
                "longitude": 120.70172119140625,
                "latitude": 28.00358772277832
              },
              {
                "site_id": 11544,
                "id": "998d81709c8695622fb90842",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "东方整形医院",
                "type": "医疗/专科医院",
                "longitude": 120.67544555664062,
                "latitude": 27.982206344604492
              },
              {
                "site_id": 10861,
                "id": "bba873888bb569a3bca8225a",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "岙底医院",
                "type": "医疗/综合医院",
                "longitude": 120.49773406982422,
                "latitude": 28.098119735717773
              },
              {
                "site_id": 28661,
                "id": "d5f93c0edb82645feddfca5b",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "同安医院",
                "type": "医疗/综合医院",
                "longitude": 120.78152465820312,
                "latitude": 28.03119468688965
              },
              {
                "site_id": 28127,
                "id": "e96b4420d9ec655882288a3a",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "景宁县人民医院",
                "type": "医疗/综合医院",
                "longitude": 119.63217163085938,
                "latitude": 27.974245071411133
              },
              {
                "site_id": 21405,
                "id": "01c612e44517474ac61b7577",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "浩瀚电脑医院",
                "type": "医疗",
                "longitude": 120.4017562866211,
                "latitude": 27.50551986694336
              },
              {
                "site_id": 8176,
                "id": "fb92b222dfd7d1bad23ce353",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "仰义医院",
                "type": "医疗",
                "longitude": 120.58342742919922,
                "latitude": 28.064035415649414
              },
              {
                "site_id": 25236,
                "id": "08fc93dfe7bbd2929b68b46a",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "朱雅医院",
                "type": "医疗",
                "longitude": 120.14665222167969,
                "latitude": 27.946802139282227
              },
              {
                "site_id": 6498,
                "id": "46fab90b9d118fc66f3e1b32",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "城关医院",
                "type": "医疗/综合医院",
                "longitude": 120.62641143798828,
                "latitude": 27.783782958984375
              },
              {
                "site_id": 6008,
                "id": "5211d2199327325b7cc876a4",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "宜山医院",
                "type": "医疗/综合医院",
                "longitude": 120.53980255126953,
                "latitude": 27.514020919799805
              },
              {
                "site_id": 8821,
                "id": "91b6132d3ea565fb28d7ab32",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "温州市仁康医院",
                "type": "医疗/专科医院",
                "longitude": 120.60142517089844,
                "latitude": 28.021602630615234
              },
              {
                "site_id": 5400,
                "id": "93df0dc331166c28892fb5a7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "曹村医院",
                "type": "医疗/综合医院",
                "longitude": 120.457275390625,
                "latitude": 27.71126937866211
              },
              {
                "site_id": 25583,
                "id": "d5f93c0edbf3645fecdfcaa8",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "慈爱康复医院",
                "type": "医疗/综合医院",
                "longitude": 120.44426727294922,
                "latitude": 27.23455047607422
              },
              {
                "site_id": 16399,
                "id": "5b25f446c86aee9710293569",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "南山医院",
                "type": "医疗/专科医院",
                "longitude": 119.62688446044922,
                "latitude": 27.982160568237305
              },
              {
                "site_id": 19822,
                "id": "b292b3aa0f85c82bbe4842c7",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "永兴医院",
                "type": "医疗/综合医院",
                "longitude": 120.81578826904297,
                "latitude": 27.899118423461914
              },
              {
                "site_id": 25677,
                "id": "d991e1167427c7561f38946f",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "陶山中心医院",
                "type": "医疗",
                "longitude": 120.48841857910156,
                "latitude": 27.847728729248047
              },
              {
                "site_id": 11876,
                "id": "1eeed5466375d8f1b5147f11",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "藤桥医院",
                "type": "医疗",
                "longitude": 120.5014877319336,
                "latitude": 28.072603225708008
              },
              {
                "site_id": 25157,
                "id": "378a6c062dbcab859a005040",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "肛泰肛肠医院",
                "type": "医疗/专科医院",
                "longitude": 120.69086456298828,
                "latitude": 28.01023292541504
              },
              {
                "site_id": 10820,
                "id": "d6ee87240cae98e3a9f0cdaa",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "南江妇产科医院",
                "type": "医疗/专科医院",
                "longitude": 120.57198333740234,
                "latitude": 27.488298416137695
              },
              {
                "site_id": 16521,
                "id": "ffb479ef9e3a12b576e5b610",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "爱尔五官科医院",
                "type": "医疗/专科医院",
                "longitude": 120.72454071044922,
                "latitude": 27.992204666137695
              },
              {
                "site_id": 28127,
                "id": "5b25f446c86aee9710293569",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "南山医院",
                "type": "医疗/专科医院",
                "longitude": 119.62688446044922,
                "latitude": 27.982160568237305
              },
              {
                "site_id": 6257,
                "id": "a0351c28f4f71b907dc876e8",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "苍南惠民医院",
                "type": "医疗",
                "longitude": 120.40550231933594,
                "latitude": 27.513778686523438
              },
              {
                "site_id": 27277,
                "id": "3a0fbba826c0d5429ee3215a",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "梅岙医院",
                "type": "医疗",
                "longitude": 120.57360076904297,
                "latitude": 28.114025115966797
              },
              {
                "site_id": 19081,
                "id": "ab4927771b07aa7354bfff1c",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "瑞安九龙医院",
                "type": "医疗",
                "longitude": 120.67619323730469,
                "latitude": 27.780969619750977
              },
              {
                "site_id": 1425,
                "id": "13d2ab1abdd4d4d6fa42b245",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "瓯海区人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.63128662109375,
                "latitude": 28.012584686279297
              },
              {
                "site_id": 19526,
                "id": "4359d28600f34987cc06a42d",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "虹丰医院",
                "type": "医疗/综合医院",
                "longitude": 121.02372741699219,
                "latitude": 28.211566925048828
              },
              {
                "site_id": 8771,
                "id": "f41f77ce1950b83e0a5cb33a",
                "val": 3.3364890258149864,
                "relation_val": 3.3364890258149864,
                "name": "鲤溪医院",
                "type": "医疗/综合医院",
                "longitude": 120.7723159790039,
                "latitude": 28.412080764770508
              },
              {
                "site_id": 15757,
                "id": "1eeed5466375d8f1b5147f11",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "藤桥医院",
                "type": "医疗",
                "longitude": 120.5014877319336,
                "latitude": 28.072603225708008
              },
              {
                "site_id": 15473,
                "id": "4db647e6375654f416c905ec",
                "val": 2.629116645587242,
                "relation_val": 2.629116645587242,
                "name": "平阳县红十字医院",
                "type": "医疗",
                "longitude": 120.53742980957031,
                "latitude": 27.609750747680664
              },
              {
                "site_id": 17414,
                "id": "74c933fb661f565d9e82ea06",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "茗屿医院",
                "type": "医疗",
                "longitude": 120.82967376708984,
                "latitude": 28.025911331176758
              },
              {
                "site_id": 15870,
                "id": "8e675f56de37ae132bb97c94",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "青田县人民医院",
                "type": "医疗/综合医院",
                "longitude": 120.28314971923828,
                "latitude": 28.13365936279297
              },
              {
                "site_id": 13416,
                "id": "8d96925c2a37df46c0f1cfaa",
                "val": 2.626483780381821,
                "relation_val": 2.626483780381821,
                "name": "苍南县第三医院",
                "type": "医疗/综合医院",
                "longitude": 120.56900024414062,
                "latitude": 27.484825134277344
              },
              {
                "site_id": 17459,
                "id": "d1469ee7cd1ccc7b84330454",
                "val": 3.7273043938285904,
                "relation_val": 3.7273043938285904,
                "name": "海桐医院",
                "type": "医疗",
                "longitude": 120.21663665771484,
                "latitude": 27.312992095947266
              }
            ]
          },
          {
            "name": "门诊",
            "val": 0.6342208385467529,
            "data": [
              {
                "site_id": 18374,
                "id": "34eb54c5aa92772288fc067e",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "瑞湖门诊",
                "type": "医疗/其他",
                "longitude": 120.62957763671875,
                "latitude": 27.791311264038086
              },
              {
                "site_id": 987,
                "id": "19ef985864f307d6f8f0cbda",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "慈爱门诊",
                "type": "医疗/其他",
                "longitude": 120.55004119873047,
                "latitude": 27.788373947143555
              },
              {
                "site_id": 20287,
                "id": "19ef985864f307d6f8f0cbda",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "慈爱门诊",
                "type": "医疗/其他",
                "longitude": 120.55004119873047,
                "latitude": 27.788373947143555
              },
              {
                "site_id": 15870,
                "id": "53349ee3fecfb41322026264",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "牙专科门诊",
                "type": "医疗/其他",
                "longitude": 120.28351593017578,
                "latitude": 28.140121459960938
              },
              {
                "site_id": 19411,
                "id": "85301a3a54f4815ec9c3dbfa",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "西医门诊",
                "type": "医疗/其他",
                "longitude": 120.66885375976562,
                "latitude": 27.978084564208984
              },
              {
                "site_id": 6163,
                "id": "c8e8f633eefcba6fab0dd808",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "永嘉秀祥门诊",
                "type": "医疗/其他",
                "longitude": 120.62967681884766,
                "latitude": 28.043678283691406
              },
              {
                "site_id": 25804,
                "id": "1ab9dbfe8134f2e7bea2403a",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "通策口腔门诊",
                "type": "医疗",
                "longitude": 120.6529541015625,
                "latitude": 27.778738021850586
              },
              {
                "site_id": 14247,
                "id": "34eb54c5aa92772288fc067e",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "瑞湖门诊",
                "type": "医疗/其他",
                "longitude": 120.62957763671875,
                "latitude": 27.791311264038086
              },
              {
                "site_id": 14423,
                "id": "12e424a2fa75e8449f9d681a",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "西医门诊",
                "type": "医疗/其他",
                "longitude": 120.65658569335938,
                "latitude": 27.975139617919922
              },
              {
                "site_id": 1618,
                "id": "2f6f5c99a4c631e7077ce826",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "本正口腔门诊",
                "type": "医疗",
                "longitude": 120.63601684570312,
                "latitude": 27.781465530395508
              },
              {
                "site_id": 27212,
                "id": "7b71472c3d92c7a1077ce88d",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "优抚门诊",
                "type": "医疗/其他",
                "longitude": 120.65359497070312,
                "latitude": 27.788986206054688
              },
              {
                "site_id": 15870,
                "id": "a51f37579aabb0c86f4760ac",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "仁爱门诊",
                "type": "医疗/其他",
                "longitude": 120.28609466552734,
                "latitude": 28.141029357910156
              },
              {
                "site_id": 10395,
                "id": "53349ee3fecfb41322026264",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "牙专科门诊",
                "type": "医疗/其他",
                "longitude": 120.28351593017578,
                "latitude": 28.140121459960938
              },
              {
                "site_id": 4249,
                "id": "a35893f74d15464fa21de918",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "犬伤门诊",
                "type": "医疗/其他",
                "longitude": 120.63856506347656,
                "latitude": 28.004993438720703
              },
              {
                "site_id": 11223,
                "id": "925c550fab9936b15a3ac842",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "骨伤科门诊",
                "type": "医疗/其他",
                "longitude": 120.5384750366211,
                "latitude": 27.61187171936035
              },
              {
                "site_id": 1151,
                "id": "022e39f5aca5807b2efaa76c",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "发热门诊",
                "type": "医疗/其他",
                "longitude": 119.71106719970703,
                "latitude": 27.560367584228516
              },
              {
                "site_id": 10395,
                "id": "a51f37579aabb0c86f4760ac",
                "val": 2.2441148619213784,
                "relation_val": 2.2441148619213784,
                "name": "仁爱门诊",
                "type": "医疗/其他",
                "longitude": 120.28609466552734,
                "latitude": 28.141029357910156
              },
              {
                "site_id": 28127,
                "id": "6954cb8bd3b3bc2a0869d9d8",
                "val": 3.1814865267141057,
                "relation_val": 3.1814865267141057,
                "name": "口腔门诊",
                "type": "医疗",
                "longitude": 119.63387298583984,
                "latitude": 27.97394371032715
              },
              {
                "site_id": 16399,
                "id": "6954cb8bd3b3bc2a0869d9d8",
                "val": 3.1814865267141057,
                "relation_val": 3.1814865267141057,
                "name": "口腔门诊",
                "type": "医疗",
                "longitude": 119.63387298583984,
                "latitude": 27.97394371032715
              }
            ]
          },
          {
            "name": "医学院",
            "val": 0.6303150057792664,
            "data": [
              {
                "site_id": 3035,
                "id": "bb303d89c8541669d2f49e53",
                "val": 2.4092655580078732,
                "relation_val": 2.4092655580078732,
                "name": "医学院小区",
                "type": "房地产/住宅区",
                "longitude": 120.66744232177734,
                "latitude": 28.01021957397461
              },
              {
                "site_id": 1242,
                "id": "161a0ed2ba2bcd535dd4fea0",
                "val": 2.4068528573508132,
                "relation_val": 2.4068528573508132,
                "name": "温州医学院第三临床医学院",
                "type": "医疗",
                "longitude": 120.63208770751953,
                "latitude": 27.78545570373535
              },
              {
                "site_id": 1387,
                "id": "c193ce234fe96c1a250bd023",
                "val": 2.4092655580078732,
                "relation_val": 2.4092655580078732,
                "name": "集味园（医学院三食堂）",
                "type": "美食",
                "longitude": 120.70689392089844,
                "latitude": 27.923694610595703
              },
              {
                "site_id": 2682,
                "id": "668f86e3e94163d78a36ee0d",
                "val": 3.4156210282016013,
                "relation_val": 3.4156210282016013,
                "name": "医学院",
                "type": "行政区划/商圈",
                "longitude": 120.66777038574219,
                "latitude": 28.010732650756836
              }
            ]
          }
        ]
      }
    ]
  }
]


export function mock() {


	d3.select('#Specification_view')
		.style('height','calc(82% - 60px)')

	d3.select('#map-view')
		.style('top','calc(82% + 10px)')

	d3.select('#semantic-view')
		.style('top','calc(82% + 10px)')
			

	let nodelist = require('../app/Specification/Node.js')
	nodelist.data = listData
	nodelist.rendering()

}

